// - Дано змінну time яка рівна числу від 0 до 59.
// Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).

    let time = prompt("Введіть число від 0 до 60", "0");
    if (time < 16) {past=1;}
        else if (time < 31) {past=2;}
        else if (time < 46) {past=3;}
        else {past=4;}
    alert(`Вказані ${time} хвилин відносяться до ${past}-ї частини години.`);

// - У змінній day дано якесь число від 1 до 31.
// Потрібно визначити, у яку половину(декаду) місяця потрапляє це число
// (у першу, другу чи третю).

    let day = Math.round(Math.random() * 31);
    if (day < 11) {console.log(day + '-й день відноситься до ПЕРШОЇ декади місяця');}
        else if (day < 21) {console.log(day + '-й день відноситься до ДРУГОЇ декади місяця');}
        else {console.log(day + '-й день відноситься до ТРЕТЬОЇ декади місяця');}

// - У нас є змінна test, якщо не дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
// Перевірте роботу скрипта при test, що дорівнює true, false.
// Напишіть два варіанти скрипта - з коротким записом(тернаркою)


// - Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'.
// Перевірте  скрипт при a, що дорівнює 1, 0, -3


// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер
// дня тижня і на екрані відображається інфа що заплановано на цей день.


// - Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.


// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме:
// „Яка «офіційна» назва JavaScript?“ Якщо користувач вводить «ECMAScript»,
// то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!