// - створити функцію яка приймає три числа та виводить найменьше. (Без Math.min!)

let minNumber = (a, b, c) => {
    let txt = 'Найменьше число';
    document.write(`<div>`);
    if (a < b && a < c) {
        document.write(`${txt} ${a}`);
    } else if (b < a && b < c) {
        document.write(`${txt} ${b}`);
    } else {
        document.write(`${txt} ${c}`);
    }
    document.write(`</div>`);
};

minNumber (36544, 8566, 8032);

// - створити функцію яка приймає три числа та виводить найбільше. (Без Math.max!)

let maxNumber = (a, b, c) => {
    let txt = 'Найбільше число';
    document.write(`<div>`);
    if (a > b && a > c) {
        document.write(`${txt} ${a}`);
    } else if (b > a && b > c) {
        document.write(`${txt}  ${b}`);
    } else {
        document.write(`${txt}  ${c}`);
    }
    document.write(`</div>`);
};

maxNumber (36544, 8566, 8032);

// - створити функцію яка повертає найбільше число з масиву

let maxArray = (numArr) => {
    return math.max(numArr);
}

document.write(`Найбільше число массиву ${numArr [100, 43, 542, 75, 765, 952]}`);

// let list = ["12","23","100","34","56", "9","233"];
// let rex = Math.max.apply(Math,list);
// document.write(`${rex}`);

// - створити функцію яка повертає найменьше число з масиву
// - створити функцію яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад [1,2,10]->13
// - створити функцію яка приймає масив чисел та повертає середнє арифметичне його значень.
// - створити функцію яка приймає будь-яку кількість чисел, повертає найменьше, а виводить найбільше (Math використовувати заборонено);
// - створити функцію яка заповнює масив рандомними числами
// (цей код генерує рандомні числа в діапазоні від 0 до 100 - Math.round(Math.random()*100)) та виводить його.
// - створити функцію яка заповнює масив рандомними числами в діапазоні від 0 до limit. limit - аргумент, який характеризує кінцеве значення діапазону.
// - Функція приймає масив та робить з нього новий масив в зворотньому порядку. [1,2,3] -> [3, 2, 1].